module TasksHelper
  def step_g(grade)
    case grade
    when 'a'
      '100'
    when 'b'
      '200'
    when 'c'
      '300'
    when 'd'
      '400'
    when 'e'
      '500'
    end
  end

  def coin(grade)
    case grade
    when 'a'
      '1000'
    when 'b'
      '2000'
    when 'c'
      '3000'
    when 'd'
      '4000'
    when 'e'
      '5000'
    end
  end

  def search_type
    { "不限" => [],
      "市场" => ["不限", "现场调研员", "电话访员", "商业数据分析", "市场策略分析", "行业顾问", "产品内测"],
      "销售" => ["不限", "促销员", "销售专员", "销售顾问", "SEO搜索引擎优化", "名片收集", "校园商品代理", "校园推广", "广告投放", "信息维护更新"],
      "公关" => ["不限", "活动方案提供", "文案提供", "PPT制作", "视频制作", "会务", "司仪", "主持", "礼仪", "模特"],
      "媒介" => ["不限", "摄影", "剪辑", "配音", "设备调控", "演出", "灯光", "作词", "作曲", "导演", "编剧"],
      "文教" => ["不限", "编辑", "校对", "录入", "翻译", "排版", "家教", "助教", "网络教学", "法务咨询", "理财顾问", "税务咨询", "会计出纳"],
      "设计" => ["不限", "发型设计", "妆容设计", "服饰建议", "衣柜整理", "广告创意", "广告文案", "广告美工", "包装设计", "工业设计", "flash动画", "H5制作", "网站设计", "游戏界面设计", "游戏角色设计", "游戏动作设计", "游戏场景设计"],
      "开发" => ["不限", "数据库开发", "公众号架构开发", "系统测试", "终端测试", "软件测试", "游戏测试"],
      "其他" => ["不限", "攻略提供", "出行安排", "工商注册", "待办业务"]}
  end

  # 投递反馈状态图片
  def feedback_img
    { fail: 'failed.png', success: 'success.png', deal: 'stay.png'}
  end

end
